tap "ankitpokhrel/jira-cli"
tap "databricks/tap"
tap "syncdk/aws-session-manager-plugin"

# Core tools
brew "git"
brew "gh"
brew "fzf"
brew "tmux"
brew "stow"

# Languages & runtimes
brew "python@3.13"
brew "python@3.11"
brew "python-setuptools"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pipx"
brew "virtualenv"
brew "go"
brew "go@1.23", link: true
brew "openjdk@11"
brew "jenv"
brew "yarn"

# Python tools
brew "ruff"
brew "ruff-lsp"

# Build tools
brew "bazelisk"
brew "cmake-docs"
brew "maven"
brew "pkgconf"
brew "swig"

# Containers & K8s
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "helm"
brew "k9s"
brew "qemu"

# Cloud & infra
brew "awscli"
brew "syncdk/aws-session-manager-plugin/aws-session-manager-plugin"
brew "databricks/tap/databricks"
brew "tfenv"
brew "jira-cli"

# Databases
brew "libpq", link: true
brew "postgresql@15", restart_service: :changed
brew "mysql-client@8.0"
brew "golang-migrate"

# Libraries
brew "freetype"
brew "libpng"
brew "librdkafka"
brew "libxml2"
brew "libxmlsec1"
brew "hdf5"
brew "snappy"
brew "openssl@3.0"
brew "tevent"
brew "zbar"

# Other tools
brew "ccusage"
brew "git-filter-repo"

# Go tools
go "golang.org/x/tools/gopls"
go "github.com/golang/mock/mockgen"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"

# Casks
cask "cursor"

# VS Code extensions
vscode "anthropic.claude-code"
vscode "bazelbuild.vscode-bazel"
vscode "cduruk.thrift"
vscode "charliermarsh.ruff"
vscode "ckolkman.vscode-postgres"
vscode "cweijan.vscode-office"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "hashicorp.terraform"
vscode "helm-ls.helm-ls"
vscode "humao.rest-client"
vscode "igorsbitnev.error-gutters"
vscode "jasonnutter.vscode-codeowners"
vscode "kangping.protobuf"
vscode "lokalise.i18n-ally"
vscode "lunuan.kubernetes-templates"
vscode "mastersam.faaaah-on-fail"
vscode "me-dutour-mathieu.vscode-github-actions"
vscode "mechatroner.rainbow-csv"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.vscode-typescript-next"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "technosophos.vscode-helm"
vscode "tim-koehler.helm-intellisense"
vscode "tomoki1207.pdf"
vscode "waderyan.gitblame"
vscode "zhuangtongfa.material-theme"
